; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph5 - mode
	spectrograph3 - mode
	image0 - mode
	thermograph1 - mode
	spectrograph2 - mode
	image6 - mode
	thermograph4 - mode
	thermograph7 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 thermograph5)
	(supports instrument0 thermograph7)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image6)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph4)
	(supports instrument1 image0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
)
(:goal (and
	(pointing satellite0 Planet14)
	(have_image Star5 spectrograph2)
	(have_image Star5 thermograph5)
	(have_image Planet6 thermograph5)
	(have_image Planet6 thermograph1)
	(have_image Star7 image6)
	(have_image Star7 thermograph4)
	(have_image Phenomenon8 image0)
	(have_image Phenomenon8 thermograph4)
	(have_image Star9 image6)
	(have_image Star9 thermograph7)
	(have_image Planet10 thermograph4)
	(have_image Planet10 spectrograph3)
	(have_image Planet11 thermograph5)
	(have_image Planet11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Phenomenon13 thermograph1)
	(have_image Planet14 thermograph7)
))

)

; plan
1. (turn_to satellite0 groundstation0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 18
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 18
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 18
4. (turn_to satellite0 star9 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star9)
   goals met: 0 of 18
5. (take_image satellite0 star9 instrument1 image6)
   added: (have_image star9 image6)
   goals met: 1 of 18
6. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 1 of 18
7. (take_image satellite0 star7 instrument1 thermograph4)
   added: (have_image star7 thermograph4)
   goals met: 2 of 18
8. (take_image satellite0 star7 instrument1 image6)
   added: (have_image star7 image6)
   goals met: 3 of 18
9. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 3 of 18
10. (take_image satellite0 star5 instrument1 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 4 of 18
11. (turn_to satellite0 planet10 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet10)
   goals met: 4 of 18
12. (take_image satellite0 planet10 instrument1 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 5 of 18
13. (take_image satellite0 planet10 instrument1 spectrograph3)
   added: (have_image planet10 spectrograph3)
   goals met: 6 of 18
14. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 6 of 18
15. (take_image satellite0 phenomenon8 instrument1 image0)
   added: (have_image phenomenon8 image0)
   goals met: 7 of 18
16. (take_image satellite0 phenomenon8 instrument1 thermograph4)
   added: (have_image phenomenon8 thermograph4)
   goals met: 8 of 18
17. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 8 of 18
18. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 8 of 18
19. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 8 of 18
20. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 8 of 18
21. (turn_to satellite0 phenomenon12 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon12)
   goals met: 8 of 18
22. (take_image satellite0 phenomenon12 instrument0 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 9 of 18
23. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 9 of 18
24. (take_image satellite0 phenomenon13 instrument0 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 10 of 18
25. (turn_to satellite0 planet11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet11)
   goals met: 10 of 18
26. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 11 of 18
27. (take_image satellite0 planet11 instrument0 thermograph5)
   added: (have_image planet11 thermograph5)
   goals met: 12 of 18
28. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 12 of 18
29. (take_image satellite0 planet6 instrument0 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 13 of 18
30. (take_image satellite0 planet6 instrument0 thermograph5)
   added: (have_image planet6 thermograph5)
   goals met: 14 of 18
31. (turn_to satellite0 star5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star5)
   goals met: 14 of 18
32. (take_image satellite0 star5 instrument0 thermograph5)
   added: (have_image star5 thermograph5)
   goals met: 15 of 18
33. (turn_to satellite0 star9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star9)
   goals met: 15 of 18
34. (take_image satellite0 star9 instrument0 thermograph7)
   added: (have_image star9 thermograph7)
   goals met: 16 of 18
35. (turn_to satellite0 planet14 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet14)
   goals met: 17 of 18
36. (take_image satellite0 planet14 instrument0 thermograph7)
   added: (have_image planet14 thermograph7)
   goals met: 18 of 18
